nominations = {
    'Scratch': {
        'переможець': 'Ісаєв Данило - переможець',
        'тема': 'Малюнок - тема',
        'оцінки': "91, 95, 90, 97, 93 - оцінки",
        'середній бал': "93,2 - середній бал",
        'дата': "20.11 - дата"
    },
    'Python': {
        'переможець' : 'Гуляєв Іван - переможець',
        'тема': 'Гра на PyGame - тема',
        'оцінки': "94, 92, 96, 94, 98 - оцінки",
        'середній бал': "94,8 - середній бал",
        'дата': "20.11 - дата"
    },
    'Java': {
        'переможець' : 'Демідов Лука - переможець',
        'тема': 'Гра на Java - тема',
        'оцінки': "94, 95, 96, 97, 98 - оцінки",
        'середній бал': "96 - середній бал",
        'дата': "20.11 - дата"
    }
}
print('Номінації')
print('1-назви номінацій, 2-інфо про номінації')
a = input('Номер дії (off-вийти):')
while a != 'off':
    if int(a) == 1:
        for nomination in nominations:
            print('-', nomination)
    if int(a) == 2:
        b = input('Назва номінації:')
        if b in nominations:
            for nm in nominations[b]:
                print(nominations[b][nm])
        else:
            print('Такої номінації не існує!')
    a = input('Номер дії (off-вийти):'
